RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_mce.c
/**
  ******************************************************************************
  * @file    stm32h7rsxx_hal_mce.c
  * @author  MCD Application Team
  * @brief   MCE HAL module driver.
  *          This file provides firmware functions to manage the following
  *          features of the Memory Cipher Engine (MCE) peripheral:
  *           + Initialization and de-initialization functions
  *           + Region setting/enable functions
  *           + Peripheral State functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
 [..]
    The MCE HAL driver can be used as follows:

    (#) ToBC (refer to MCE comments)


    [..]

    *** Callback registration ***
    =============================================
    [..]

     The compilation flag USE_HAL_MCE_REGISTER_CALLBACKS, when set to 1,
     allows the user to configure dynamically the driver callbacks.
     Use Functions @ref HAL_MCE_RegisterCallback()
     to register an interrupt callback.
    [..]

     ToBC (refer to MCE comments)

     When the compilation flag USE_HAL_MCE_REGISTER_CALLBACKS is set to 0 or
     not defined, the callback registration feature is not available and all callbacks
     are set to the corresponding weak functions.

  @endverbatim
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_hal.h"

/** @addtogroup STM32H7RSxx_HAL_Driver
  * @{
  */

/** @defgroup MCE MCE
  * @brief MCE HAL module driver.
  * @{
  */


#ifdef HAL_MCE_MODULE_ENABLED

#if defined(MCE1)

/* Private typedef -----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
#define MCE_TIMEOUT_VALUE  255U   /* Internal timeout for keys valid flag */
#define MCE1_CONTEXT_NB    2U
/* Private macros ------------------------------------------------------------*/


#define IS_MCE_AES_INSTANCE(INSTANCE) ((INSTANCE) == MCE1)
#define IS_MCE_NOEKEON_INSTANCE(INSTANCE) ((INSTANCE) == MCE2) || ((INSTANCE) == MCE3)

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/



/* Exported functions --------------------------------------------------------*/
/** @addtogroup MCE_Exported_Functions
  * @{
  */

/** @defgroup MCE_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions.
  *
@verbatim
  ==============================================================================
              ##### Initialization and de-initialization functions #####
  ==============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the MCE peripheral and create the associated handle.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_Init(MCE_HandleTypeDef *hmce)
{
  /* Check the MCE handle allocation */
  if (hmce == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));

  if (hmce->State == HAL_MCE_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    __HAL_UNLOCK(hmce);

#if (USE_HAL_MCE_REGISTER_CALLBACKS == 1)
    /* Init the MCE Callback settings */
    hmce->ErrorCallback = HAL_MCE_ErrorCallback; /* Legacy weak callback */

    if (hmce->MspInitCallback == NULL)
    {
      hmce->MspInitCallback = HAL_MCE_MspInit; /* Legacy weak MspInit */
    }

    /* Init the low level hardware */
    hmce->MspInitCallback(hmce);
#else
    /* Init the low level hardware */
    HAL_MCE_MspInit(hmce);
#endif /* USE_HAL_MCE_REGISTER_CALLBACKS */
  }

  /* Change the MCE state */
  hmce->State = HAL_MCE_STATE_READY;

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  DeInitialize the MCE peripheral.
  * @note   Any lock set at peripheral, key or cipher context level requires a MCE peripheral reset
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_DeInit(MCE_HandleTypeDef *hmce)
{
  MCE_Region_TypeDef *p_region;
  MCE_Context_TypeDef *p_context;

  /* Check the MCE handle allocation */
  if (hmce == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));

  /* Change the MCE state */
  hmce->State = HAL_MCE_STATE_BUSY;

  /* Disable interrupts */
  CLEAR_BIT(hmce->Instance->IAIER, MCE_IAIER_IAEIE | MCE_IAIER_CAEIE);

  /* Disable all regions */
  for (uint32_t i = MCE_REGION1; i <= MCE_REGION4; i++)
  {
    p_region = (MCE_Region_TypeDef *)((uint32_t)(hmce->Instance) + 0x40U + (0x10U * i));
    CLEAR_BIT(p_region->REGCR, MCE_REGCR_BREN);
    CLEAR_BIT(p_region->ATTR, MCE_ATTR_WREN);
  }

  /* Disable all cipher contexts if any for the MCE instance */
  if (hmce->Instance == MCE1)
  {
    for (uint32_t i = 0; i < MCE1_CONTEXT_NB; i++)
    {
      p_context = (MCE_Context_TypeDef *)((uint32_t)(hmce->Instance) + 0x240U + (0x30U * i));
      CLEAR_BIT(p_context->CCCFGR, MCE_CCCFGR_CCEN);
    }
  }

  /* Clear privileged-only configuration access */
  CLEAR_BIT(hmce->Instance->PRIVCFGR, MCE_PRIVCFGR_PRIV);

