RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_mce.c
  assert_param(IS_MCE_WRITE(pConfig->AccessMode));
  assert_param(IS_MCE_REGIONPRIVILEGED(pConfig->PrivilegedAccess));

  /* If global lock is set or no configuration provided, region cannot be configured */
  if (((hmce->Instance->CR & MCE_CR_GLOCK) != MCE_CR_GLOCK) && (pConfig != NULL))
  {
    /* Take Lock */
    __HAL_LOCK(hmce);

    address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x40U + (0x10U * RegionIndex));
    p_region = (MCE_Region_TypeDef *)address;

    /* If region is enabled, disable it during the configuration process */
    if ((p_region->REGCR & MCE_REGCR_BREN) == MCE_REGCR_BREN)
    {
      CLEAR_BIT(p_region->REGCR, MCE_REGCR_BREN);
    }

    /* Set privileged access, ciphering algorithm and context ID */
    MODIFY_REG(p_region->REGCR,  MCE_REGCR_ENC | MCE_REGCR_PRIV, \
               pConfig->PrivilegedAccess | pConfig->Mode);

    /* Set start and end addresses */
    WRITE_REG(p_region->SADDR, pConfig->StartAddress);
    WRITE_REG(p_region->EADDR, pConfig->EndAddress);

    /* Set write attribute for the region */
    MODIFY_REG(p_region->ATTR, MCE_ATTR_WREN, pConfig->AccessMode);

    /* Enable the region by default */
    SET_BIT(p_region->REGCR, MCE_REGCR_BREN);

    ret = HAL_OK;

    /* Release Lock */
    __HAL_UNLOCK(hmce);
  }

  return ret;

}

HAL_StatusTypeDef HAL_MCE_SetRegionAESContext(MCE_HandleTypeDef *hmce, uint32_t ContextIndex, uint32_t RegionIndex)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  MCE_Region_TypeDef *p_region;
  __IO uint32_t address;

  assert_param(IS_MCE_CONTEXT(hmce->Instance, ContextIndex));
  assert_param(IS_MCE_REGIONINDEX(RegionIndex));

  /* If global lock is set, region cannot be configured */
  if ((hmce->Instance->CR & MCE_CR_GLOCK) != MCE_CR_GLOCK)
  {

    /* Take Lock */
    __HAL_LOCK(hmce);

    address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x40U + (0x10U * RegionIndex));
    p_region = (MCE_Region_TypeDef *)address;

    /* If region is enabled, disable it during the configuration process */
    if ((p_region->REGCR & MCE_REGCR_BREN) == MCE_REGCR_BREN)
    {
      CLEAR_BIT(p_region->REGCR, MCE_REGCR_BREN);
    }

    /* Set context ID */
    MODIFY_REG(p_region->REGCR, MCE_REGCR_CTXID, ContextIndex);

    /* Enable the region by default */
    SET_BIT(p_region->REGCR, MCE_REGCR_BREN);

    ret = HAL_OK;

    /* Release Lock */
    __HAL_UNLOCK(hmce);

  }

  return ret;
}


/** *********  Enabling and disabling functions : enable/disable AES and Noekeon configurations and regions *********/


/**
  * @brief  Cipher context enable
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @param  ContextIndex index of context that is enabled
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_EnableAESContext(MCE_HandleTypeDef *hmce, uint32_t ContextIndex)
{
  MCE_Context_TypeDef *p_context;
  __IO uint32_t address;

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));
  assert_param(IS_MCE_CONTEXT(hmce->Instance, ContextIndex));

  if ((ContextIndex != MCE_CONTEXT1) && (ContextIndex != MCE_CONTEXT2))
  {
    return HAL_ERROR;
  }

  address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x240UL + \
                            (0x30UL * ((ContextIndex - MCE_CONTEXT1) >> MCE_REGCR_CTXID_Pos)));
  p_context = (MCE_Context_TypeDef *)address;

  /* If cipher context is locked or if global lock is set,
     and if cipher context is not enabled already, return an error */

  if ((p_context->CCCFGR & MCE_CCCFGR_CCEN) != MCE_CCCFGR_CCEN)
  {
    if ((p_context->CCCFGR & MCE_CCCFGR_CCLOCK) == MCE_CCCFGR_CCLOCK)
    {
      return HAL_ERROR;
    }
    if ((hmce->Instance->CR & MCE_CR_GLOCK) == MCE_CR_GLOCK)
    {
      return HAL_ERROR;
    }
  }

  __HAL_LOCK(hmce);

  /* Enable context */
  SET_BIT(p_context->CCCFGR, MCE_CCCFGR_CCEN);

  __HAL_UNLOCK(hmce);

  return HAL_OK;

}

/**
  * @brief  Cipher context disable
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @param  ContextIndex index of context that is disabled
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_DisableAESContext(MCE_HandleTypeDef *hmce, uint32_t ContextIndex)
{
  MCE_Context_TypeDef *p_context;
  __IO uint32_t address;

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));
  assert_param(IS_MCE_CONTEXT(hmce->Instance, ContextIndex));

  if ((ContextIndex != MCE_CONTEXT1) && (ContextIndex != MCE_CONTEXT2))
  {
    return HAL_ERROR;
  }

  address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x240UL + \
                            (0x30UL * ((ContextIndex - MCE_CONTEXT1) >> MCE_REGCR_CTXID_Pos)));
  p_context = (MCE_Context_TypeDef *)address;

  /* If cipher context is locked or if global lock is set,
     and if cipher context is not disabled already, return an error */

  if ((p_context->CCCFGR & MCE_CCCFGR_CCEN) == MCE_CCCFGR_CCEN)
  {
    if ((p_context->CCCFGR & MCE_CCCFGR_CCLOCK) == MCE_CCCFGR_CCLOCK)
    {
      return HAL_ERROR;
    }
    if ((hmce->Instance->CR & MCE_CR_GLOCK) == MCE_CR_GLOCK)
    {
      return HAL_ERROR;
    }
  }

  __HAL_LOCK(hmce);

  /* Disable context */
  CLEAR_BIT(p_context->CCCFGR, MCE_CCCFGR_CCEN);

  __HAL_UNLOCK(hmce);

  return HAL_OK;

}


/**
  * @brief  Enable region.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @param  RegionIndex index of region that is enabled
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MCE_EnableRegion(MCE_HandleTypeDef *hmce, uint32_t RegionIndex)
{
  HAL_StatusTypeDef ret = HAL_ERROR;
  MCE_Region_TypeDef *p_region;
  __IO uint32_t address;

  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));
  assert_param(IS_MCE_REGIONINDEX(RegionIndex));

  /* If global lock is set, region cannot be configured */
  if ((hmce->Instance->CR & MCE_CR_GLOCK) != MCE_CR_GLOCK)
  {
    address = (__IO uint32_t)((uint32_t)hmce->Instance + 0x40U + (0x10U * RegionIndex));
    p_region = (MCE_Region_TypeDef *)address;

    /* Take Lock */
    __HAL_LOCK(hmce);

    /* Check region is not enabled, else error */
    if ((p_region->REGCR & MCE_REGCR_BREN) != MCE_REGCR_BREN)
    {
      /* Enable the region */
      SET_BIT(p_region->REGCR, MCE_REGCR_BREN);

      ret = HAL_OK;
    }

    /* Release Lock */
    __HAL_UNLOCK(hmce);
  }

  return ret;

