RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_mce.c
    crc = 0;
    for (i = 0; i < (uint8_t)32; i++)
    {
      k = ((((uint32_t)crc >> 7) ^ ((keyval >> ((uint8_t)31 - i)) & ((uint8_t)0xF)))) & 1U;
      crc <<= 1;
      if (k != 0U)
      {
        crc ^= crc7_poly;
      }
    }

    crc ^= (uint8_t)0x55;
  }

  return (uint32_t) crc;
}

/**
  * @brief  Handle MCE interrupt request.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval None
  */
void HAL_MCE_IRQHandler(MCE_HandleTypeDef *hmce)
{
  uint32_t isr_reg;
  uint32_t iaesr_reg;

  isr_reg = READ_REG(hmce->Instance->IASR);
  if ((isr_reg & MCE_IASR_CAEF) == MCE_IASR_CAEF)
  {
    /* Set configuration access error */
    hmce->ErrorCode |= HAL_MCE_CONFIGURATION_ACCESS_ERROR;

    /* Clear configuration access error flag */
    WRITE_REG(hmce->Instance->IACR, MCE_IACR_CAEF);
  }
  if ((isr_reg & MCE_IASR_IAEF) == MCE_IASR_IAEF)
  {
    iaesr_reg = (READ_REG(hmce->Instance->IAESR) & (MCE_IAESR_IAPRIV | MCE_IAESR_IANRW));

    /* Clear illegal access error flag */
    WRITE_REG(hmce->Instance->IACR, MCE_IACR_IAEF);

    /* Set precise illegal access error */
    if (iaesr_reg == MCE_IAESR_IAPRIV)
    {
      /* Illegal privileged data read or instruction fetch access error */
      hmce->ErrorCode |= HAL_MCE_ILLEGAL_ACCESS_READ_PRIV_ERROR;
    }
    else if (iaesr_reg == (MCE_IAESR_IAPRIV | MCE_IAESR_IANRW))
    {
      /* Illegal privileged data write access error */
      hmce->ErrorCode |= HAL_MCE_ILLEGAL_ACCESS_WRITE_PRIV_ERROR;
    }
    else if (iaesr_reg == MCE_IAESR_IANRW)
    {
      /* Illegal un privileged data write access error */
      hmce->ErrorCode |= HAL_MCE_ILLEGAL_ACCESS_WRITE_NPRIV_ERROR;
    }
    else
    {
      /* Illegal unprivileged data read or instruction fetch access error */
      hmce->ErrorCode |= HAL_MCE_ILLEGAL_ACCESS_READ_NPRIV_ERROR;
    }
  }

#if (USE_HAL_MCE_REGISTER_CALLBACKS == 1)
  hmce->ErrorCallback(hmce);
#else
  HAL_MCE_ErrorCallback(hmce);
#endif /* USE_HAL_MCE_REGISTER_CALLBACKS */
}

/**
  * @brief MCE error callback.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval None
  */
__weak void HAL_MCE_ErrorCallback(MCE_HandleTypeDef *hmce)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmce);

  /* NOTE : This function should not be modified; when the callback is needed,
            the HAL_MCE_ErrorCallback can be implemented in the user file.
   */
}

/**
  * @brief  Return the MCE state.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval HAL status
  */
HAL_MCE_StateTypeDef HAL_MCE_GetState(MCE_HandleTypeDef const *hmce)
{
  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));

  return hmce->State;
}

/**
  * @brief  Return the MCE error code.
  * @param  hmce pointer to an MCE_HandleTypeDef structure that contains
  *         the configuration information for MCE module
  * @retval MCE error code (bitfield on 32 bits)
  */
uint32_t HAL_MCE_GetError(MCE_HandleTypeDef const *hmce)
{
  /* Check the parameters */
  assert_param(IS_MCE_ALL_INSTANCE(hmce->Instance));

  return hmce->ErrorCode;
}



/**
  * @}
  */

/**
  * @}
  */

#endif /* MCE1 */

#endif /* HAL_MCE_MODULE_ENABLED */


/**
  * @}
  */

/**
  * @}
  */
